let initialState = {
    table: [
        {
          img: "a1.jpg",
          title: 'Ультра-Модерн',
          text: 'Строгий стиль в ярких цветах.'
        },
        {
          img: "a2.jpg",
          title: 'Торжество',
          text: 'Величие и торжественность.'
        },
        {
          img: "a3.jpg",
          title: 'Восточная кухня',
          text: 'Всегда изыскано и со вскусом.'
        },
        {
          img: "a4.jpg",
          title: 'Дачная тематика',
          text: 'В духе народных традиций.'
        },
        {
          img: "a5.jpg",
          title: 'Восточные мотивы',
          text: 'Каждая мелочь имеет свой смысл'
        },
        {
            img: "a6.jpg",
            title: 'Простота со вкусом',
            text: 'Чем проще, тем лучше.'
          },
          {
            img: "a7.jpg",
            title: 'Сиреневый мотив',
            text: 'Мягкие цвета создают уют.'
          },
          {
            img: "a9.jpg",
            title: 'Рождество',
            text: 'Красный и белый - огонь и лед.'
          },
          {
            img: "a10.jpg",
            title: 'Пасха',
            text: 'Зеленый-символ новой жизни'
          },
          {
            img: "a11.jpg",
            title: 'Новый год',
            text: 'Аромат зимнего праздника.'
          },
          {
            img: "a12.jpg",
            title: 'Нежность',
            text: 'Мягкие розовые оттенки.'
          },
          {
            img: "a20.jpg",
            title: 'Новый год',
            text: 'Красный и белый- огонь и лед'
          },
          {
            img: "a22.jpg",
            title: 'Пасха',
            text: 'Яркие цвета создают настроение.'
          },
          {
            img: "a23.jpg",
            title: 'Пасха',
            text: 'Символ новой жизни.'
          },
          {
            img: "a21.jpg",
            title: 'Новый год',
            text: 'Даже мелочи создают настроение.'
          },
      ],
}

export const sliderReducer = (state = initialState, action)=> {
    
          return state
}